In [1]:
import pandas as pd

In [38]:
dfChar = pd.read_csv('star-wars/characters.csv',sep=',', encoding='utf-8',quoting=0,)
dfPlant = pd.read_csv('star-wars/planets.csv',sep=',', encoding='utf-8',quoting=0,)
dfSpec = pd.read_csv('star-wars/species.csv',sep=',', encoding='utf-8',quoting=0,)
dfStar = pd.read_csv('star-wars/starships.csv',sep=',', encoding='utf-8',quoting=0,)
dfVeh = pd.read_csv('star-wars/vehicles.csv',sep=',', encoding='utf-8',quoting=0,)

In [39]:
dfChar.head()

,name,height,mass,hair_color,skin_color,eye_color,birth_year,gender,homeworld,species
0,Luke Skywalker,172.0,77,blond,fair,blue,19BBY,male,Tatooine,Human
1,C-3PO,167.0,75,NaN,gold,yellow,112BBY,NaN,Tatooine,Droid
2,R2-D2,96.0,32,NaN,"white, blue",red,33BBY,NaN,Naboo,Droid
3,Darth Vader,202.0,136,none,white,yellow,41.9BBY,male,Tatooine,Human
4,Leia Organa,150.0,49,brown,light,brown,19BBY,female,Alderaan,Human

In [60]:
dfchar2 = dfChar.groupby('homeworld')['name'].count()
dfchar2

homeworld
Alderaan           3
Aleen Minor        1
Bespin             1
Bestine IV         1
Cato Neimoidia     1
Cerea              1
Champala           1
Chandrila          1
Concord Dawn       1
Corellia           2
Coruscant          3
Dathomir           1
Dorin              1
Endor              1
Eriadu             1
Geonosis           1
Glee Anselm        1
Haruun Kal         1
Iktotch            1
Iridonia           1
Kalee              1
Kamino             3
Kashyyyk           2
Malastare          1
Mirial             2
Mon Cala           1
Muunilinst         1
Naboo             11
Nal Hutta          1
Ojom               1
Quermia            1
Rodia              1
Ryloth             2
Serenno            1
Shili              1
Skako              1
Socorro            1
Stewjon            1
Sullust            1
Tatooine          10
Toydaria           1
Trandosha          1
Troiken            1
Tund               1
Umbara             1
Utapau             1
Vulpter            1
Zolan              1
Name: name, dtype: int64

In [61]:
dfPlant.head()
dfPlant2 = dfPlant.groupby('climate')['surface_water'].count()
dfPlant2

climate
arid                          1
arid, rocky, windy            0
arid, temperate, tropical     0
artificial temperate          1
frigid                        1
frozen                        1
hot                           2
hot, humid                    0
murky                         1
polluted                      0
superheated                   1
temperate                    12
temperate, arid               1
temperate, arid, subartic     1
temperate, arid, windy        1
temperate, artic              0
temperate, moist              0
temperate, tropical           1
tropical                      1
tropical, temperate           1
Name: surface_water, dtype: int64

In [71]:
dfSpec.head()
dfSpec2 = dfSpec.groupby('hair_colors')['classification'].count()
dfSpec2

hair_colors
black                         1
black, brown                  2
blonde, brown, black, red     1
brown, white                  1
none                         20
red, blond, black, white      1
white, brown, black           1
Name: classification, dtype: int64

In [68]:
dfStar.head()
dfchar2 = dfStar.groupby('max_atmosphering_speed')['passengers'].count()
dfchar2

max_atmosphering_speed
1000      3
1000km    1
1050      5
1100      2
1150      1
1180      1
1200      1
1300      1
1500      1
1600      1
2000      2
650       1
800       1
8000      0
850       1
900       1
920       0
950       2
975       2
Name: passengers, dtype: int64

In [63]:
dfVeh.head()
dfVeh2 = dfVeh.groupby('cost_in_credits')['vehicle_class'].count()
dfVeh2

cost_in_credits
2500.0      1
4000.0      1
5750.0      1
8000.0      3
10550.0     1
12125.0     1
14500.0     1
14750.0     1
15000.0     1
20000.0     1
40000.0     1
49000.0     1
60000.0     1
75000.0     1
138000.0    1
150000.0    1
200000.0    1
285000.0    1
350000.0    1
Name: vehicle_class, dtype: int64